# a = '1111111111111111111111111111111111111111111111111111'
# b = '2202220222202222022202222200002222022220222022200002'
# c = '3303030333030333003303333033333330303330033033033333'
# d = '4404040444040444040404444000004440404440404044040004'
# e = '3300000330000033033003333333303300000330330033033303'
# f = '2220202220222022022202222000022202220220222022200022'
# g = '1111111111111111111111111111111111111111111111111111'

# # 설계도 회전하고 마지막 1 써주기
# # 2차원 리스트로 만들기
# two_dimensional_list = [[int(i) for i in k] for k in [a, b, c, d, e, f, g]]
# new_list = list(map(list, zip(*two_dimensional_list)))  # 회전하기
# # print(new_list)
# for i in new_list:
#     for j in i:
#         print(j, end='')
# print()

설계도 = '12343211234321100002112340011200021123400110000211234321123432112340011200021103402112000211234001123432112343211000001120432112303211234021100000112343211234321123432112343211200301103030110303011030301103002112343211234321123400112000211034021120002112340011234321123432110000011204321123032112340211000001123432112343211200021103430110303011030301103002112343211'
Month_name = ['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC']
Month_count = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
month = 0
day = 0

for i in 설계도:
    # 날짜 갱신
    day += 1
    # 날짜 정보 갱신
    over_count = int(Month_count[month])
    if over_count < day:
        day -= over_count
        month += 1

    # 설계도의 숫자를 보고 반복
    for j in range(int(i)):
        print(f'{Month_name[month]} {day}', end=' ')
        # TODO: 파일 수정 코드 추가
        # 깃 업데이트
        #    git add .
        #    git commit -m "1"
        #    git commit --amend --no-edit --date "${Month_name[month]} ${day} 12:0:00 2017 +0000"

# 결과: JAN 1 JAN 2 JAN 2 JAN 3 ... DEC 29 DEC 29 DEC 30 DEC 31
